app/views/request/user_dashboard.html.erb

		<td> <%= item.count %> </td>
		<td> <%= link_to "edit", :controller => 'request', :action => 'update' , :item => item.item_name , :value => item.count %> </td>
---
SELECT "items".* FROM "items" WHERE (item_name LIKE 'p%')
SELECT "requests".* FROM "requests" WHERE (team_id = 2)
SELECT COUNT(*) FROM "requests" WHERE (team_id = 1)