app/controllers/items_controller.rb

  def create
    @item = Item.new
    @item.item_name = params[:item_name]
    @item.item_total = Integer(params[:item_total])
    @item.item_requested = 0
    @item.item_approved = 0
    @item.item_remaining = params[:item_total]
    @item.save
---
INSERT INTO "items" ("created_at", "item_approved", "item_name", "item_remaining", "item_requested", "item_total", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def admin_dashboard
    @items = Item.all
---
SELECT "items".* FROM "items"

  def list_by_team
    if params[:team_id] == nil
      @teams = Team.all
    else
      @requests = Request.where(:team_id => params[:team_id])
      @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams"
SELECT "requests".* FROM "requests" WHERE "requests"."team_id" = 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]

  def list_by_item
    @requests = Request.where(:item_id => params[:item_id])
    @item = Item.find(params[:item_id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."item_id" = 1
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]

  def approve
    @item = Item.find_by_id(params[:item_id])
    @request = Request.find_by_id(params[:request_id])
    @log = Log.where( "request_id = #{params[:request_id]} and item_id = #{params[:item_id]} and team_id = #{params[:team_id]}").first;
    if Integer(params[:toApprove]) <= Integer(@item.item_remaining) and Integer(params[:toApprove]) <= @request.requested
      @request.approved = @request.approved + Integer(params[:toApprove])
      @item.item_remaining = @item.item_remaining - Integer(params[:toApprove])
      @item.item_approved = @item.item_approved + Integer(params[:toApprove])
      @log.requested = @request.requested
      @log.approved = @request.approved
      if @request.approved == @request.requested
         @log.status = 'Approved'
       elsif @request.approved < @request.requested
         @log.status = 'Pending'
       elsif @request.requested == 0
         @log.status = 'Returned'
       end
    elsif Integer(params[:toApprove]) > Integer(@item.item_remaining)
       flash[:notice] = "Cannot approve more than remaining items"
     else
       flash[:notice] = "Cannot approve more than requested"
    end
    # @log.save
    @request.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = 5 LIMIT 1
SELECT "requests".* FROM "requests" WHERE "requests"."id" = 6 LIMIT 1
SELECT "logs".* FROM "logs" WHERE (request_id = 14 and item_id = 6 and team_id = 1) ORDER BY "logs"."id" ASC LIMIT 1
UPDATE "items" SET "item_remaining" = ?, "item_approved" = ?, "updated_at" = ? WHERE "items"."id" = 5  [["item_remaining", 45], ["item_approved", 5], ["updated_at", Fri, 25 Sep 2015 18:50:08 UTC +00:00]]
UPDATE "logs" SET "approved" = ?, "status" = ?, "updated_at" = ? WHERE "logs"."id" = 14  [["approved", 20], ["status", "Pending"], ["updated_at", Thu, 01 Oct 2015 12:42:24 UTC +00:00]]
UPDATE "requests" SET "approved" = ?, "updated_at" = ? WHERE "requests"."id" = 6  [["approved", 5], ["updated_at", Fri, 25 Sep 2015 18:50:08 UTC +00:00]]

  def return
    @item = Item.find_by_id(params[:item_id])
    @request = Request.find_by_id(params[:request_id])
    @log = Log.where( "request_id = #{params[:request_id]} and item_id = #{params[:item_id]} and team_id = #{params[:team_id]}").first;
    @request.requested = @request.requested - Integer(params[:toReturn])
    @request.approved = @request.approved - Integer(params[:toReturn])
    @item.item_remaining = @item.item_remaining + Integer(params[:toReturn])
    @item.item_approved = @item.item_approved - Integer(params[:toReturn])
	@item.item_requested = @item.item_requested - Integer(params[:toReturn])
    #@log.requested = @request.requested
    #@log.approved = @request.approved
    if @request.approved == @request.requested
      @log.status = 'Approved'
    elsif @request.approved < @request.requested
      @log.status = 'Pending'
    elsif @request.requested == 0
      @log.status = 'Returned'
    end
    @log.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = 6 LIMIT 1
SELECT "requests".* FROM "requests" WHERE "requests"."id" = 12 LIMIT 1
SELECT "logs".* FROM "logs" WHERE (request_id = 12 and item_id = 6 and team_id = 1) ORDER BY "logs"."id" ASC LIMIT 1
UPDATE "items" SET "item_remaining" = ?, "item_approved" = ?, "item_requested" = ?, "updated_at" = ? WHERE "items"."id" = 8  [["item_remaining", 48], ["item_approved", 2], ["item_requested", 2], ["updated_at", Mon, 05 Oct 2015 11:17:43 UTC +00:00]]
UPDATE "logs" SET "requested" = ?, "approved" = ?, "updated_at" = ? WHERE "logs"."id" = 14  [["requested", 4], ["approved", 2], ["updated_at", Mon, 05 Oct 2015 10:55:02 UTC +00:00]]
UPDATE "requests" SET "requested" = ?, "approved" = ?, "updated_at" = ? WHERE "requests"."id" = 12  [["requested", 0], ["approved", 0], ["updated_at", Mon, 05 Oct 2015 10:53:25 UTC +00:00]]

  def total
    @item = Item.find(params[:item_id])
    puts 'ID => ' + params[:item_id]
    puts 'Task => ' + params[:task]
    if params[:task] == 'plus'
      @item.item_total = @item.item_total + Integer(params[:number])
      @item.item_remaining = @item.item_total - @item.item_approved
    elsif params[:task] == 'minus'
      if @item.item_total - Integer(params[:number]) > 0
        @item.item_total = @item.item_total - Integer(params[:number])
        @item.item_remaining = @item.item_total - @item.item_approved
      end
    end

    if @item.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "item_total" = ?, "item_remaining" = ?, "updated_at" = ? WHERE "items"."id" = 1  [["item_total", 52], ["item_remaining", 52], ["updated_at", Fri, 25 Sep 2015 18:11:50 UTC +00:00]]