app/controllers/items_controller.rb

  def list_by_team
    if params[:team_id] == nil and params[:team_type] == nil
      @temp = "Hello" # dummy parameter to use for if elif conditions
    elsif params[:team_id] == nil and params[:team_type] != nil
      @teams = Team.where(:team_type => params[:team_type])
---
SELECT "teams".* FROM "teams" WHERE "teams"."team_type" = 'events'