app/controllers/request_controller.rb

  def create
    @item=Item.where("item_name LIKE '#{params[:item_name]}%'")
---
SELECT "items".* FROM "items" WHERE (item_name LIKE 'p%')

  def add
    if params[:count].to_i > 0
      flash[:error] = false
      item=TempReq.where("team_id = #{session[:team_id]} and item_name='#{params[:item]}'")
      if item.empty?
        tmp=TempReq.new
        tmp.team_id = session[:team_id]
        tmp.item_name = "#{params[:item]}"
        tmp.count = params[:count]
        tmp.save
        redirect_to(:controller => 'request', :action => 'user_dashboard')
      else
        @item=TempReq.where("team_id = #{session[:team_id]} and item_name='#{params[:item]}'")
        for item in @item
          item.count = params[:count]
          item.save
---
SELECT "temp_reqs".* FROM "temp_reqs" WHERE (team_id = 1 and item_name='pen')
SELECT COUNT(*) FROM "temp_reqs" WHERE (team_id = 1 and item_name='pen')
INSERT INTO "temp_reqs" ("count", "created_at", "item_name", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["count", 10], ["created_at", Fri, 25 Sep 2015 18:22:51 UTC +00:00], ["item_name", "pen"], ["team_id", 1], ["updated_at", Fri, 25 Sep 2015 18:22:51 UTC +00:00]]
UPDATE "temp_reqs" SET "count" = ?, "updated_at" = ? WHERE "temp_reqs"."id" = 1  [["count", 11], ["updated_at", Fri, 25 Sep 2015 18:23:04 UTC +00:00]]

  def destroy
    TempReq.where("team_id = #{session[:team_id]} and item_name='#{params[:item]}'").destroy_all
---
DELETE FROM "temp_reqs" WHERE "temp_reqs"."id" = ?  [["id", 2]]
SELECT "temp_reqs".* FROM "temp_reqs" WHERE (team_id = 1 and item_name='pencil')

  def late_destroy
    @item=Request.where("team_id = #{session[:team_id]} and item_id=#{params[:item_id]} and id=#{params[:req_id]}").first
    @log=Log.where("team_id = #{session[:team_id]} and item_id=#{params[:item_id]} and id=#{params[:req_id]}").first
    @id = Item.where("id = #{params[:item_id]}").first
    #var=@item.requested.to_i - @item.approved.to_i
    if @item.approved.to_i == 0
      @id.item_requested = (@id.item_requested.to_i - (@item.requested.to_i - @item.approved.to_i)).to_s
      @item.destroy
      @log.destroy

    else
      @id.item_requested = (@id.item_requested.to_i - (@item.requested.to_i - @item.approved.to_i)).to_s
      @item.requested=@item.approved
      @item.save
      @log.requested=@log.approved
      @log.save
---
SELECT "requests".* FROM "requests" WHERE (team_id = 1 and item_id=5 and id=2) ORDER BY "requests"."id" ASC LIMIT 1
SELECT "logs".* FROM "logs" WHERE (team_id = 1 and item_id=1 and id=4) ORDER BY "logs"."id" ASC LIMIT 1
SELECT "items".* FROM "items" WHERE (id = '2') ORDER BY "items"."id" ASC LIMIT 1
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 4]]
UPDATE "items" SET "item_requested" = ?, "updated_at" = ? WHERE "items"."id" = 1  [["item_requested", 15], ["updated_at", Thu, 01 Oct 2015 12:14:39 UTC +00:00]]
UPDATE "requests" SET "requested" = ?, "updated_at" = ? WHERE "requests"."id" = 2  [["requested", 0], ["updated_at", Fri, 25 Sep 2015 18:23:39 UTC +00:00]]
UPDATE "logs" SET "requested" = ?, "updated_at" = ? WHERE "logs"."id" = 6  [["requested", 0], ["updated_at", Thu, 01 Oct 2015 11:34:19 UTC +00:00]]

  def submit
    @item=TempReq.where("team_id = #{session[:team_id]}")
    for item in @item
      @id = Item.where("item_name = '#{item.item_name}'").first

        tmp=Request.where("team_id = #{session[:team_id]} and item_id=#{@id.id}")
        #if tmp.empty?
        req=Request.new
        req.team_id = session[:team_id]
        req.item_id = @id.id
        req.requested = item.count
        req.approved = 0
        req.allotted = 0
        req.save
        #else
        #	@req=Request.where("user_id = #{session[:user_id]} and item_id=#{id.id}")
        #	for req in @req
        #		req.requested = req.requested + item.count
        #		req.save
        #	end
        #end

        log=Log.new
        log.request_id = req.id
        log.team_id = session[:team_id]
        log.item_id = @id.id
        log.requested = item.count
        log.approved = 0
        log.allotted = 0
        log.status = "pending"
        log.save


        @id.item_requested = (@id.item_requested.to_i + item.count.to_i).to_s
        @id.save
---
SELECT "temp_reqs".* FROM "temp_reqs" WHERE (team_id = 1)
SELECT "items".* FROM "items" WHERE (item_name = 'pen') ORDER BY "items"."id" ASC LIMIT 1
INSERT INTO "requests" ("approved", "created_at", "item_id", "requested", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["approved", 0], ["created_at", Fri, 25 Sep 2015 18:23:28 UTC +00:00], ["item_id", 1], ["requested", 10], ["team_id", 1], ["updated_at", Fri, 25 Sep 2015 18:23:28 UTC +00:00]]
INSERT INTO "logs" ("approved", "created_at", "item_id", "request_id", "requested", "status", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "items" SET "item_requested" = ?, "updated_at" = ? WHERE "items"."id" = 5  [["item_requested", 10], ["updated_at", Fri, 25 Sep 2015 18:47:34 UTC +00:00]]

  def display
    @req=Request.where("team_id = #{session[:team_id]}")
    @ary=Array.new
    for req in @req
      @item=Item.where("id=#{req.item_id}")
---
SELECT "requests".* FROM "requests" WHERE (team_id = 1)
SELECT "items".* FROM "items" WHERE (id=1)

  def log
    @l=Log.where("team_id = #{session[:team_id]}")
    @ary=Array.new
    for l in @l
      @item=Item.where("id=#{l.item_id}")
---
SELECT "logs".* FROM "logs" WHERE (team_id = 1)
SELECT "items".* FROM "items" WHERE (id=5)

  def user_dashboard
    #user=User.find(session[:user_id])

    #flash[:id]=user[:team_id]
    @item=TempReq.where("team_id = #{session[:team_id]}")
    @req_item=Request.where("team_id = #{session[:team_id]}")
    if !params[:item_name].nil? && !params[:item_name].blank?
      @itemList=Item.where("item_name LIKE '#{params[:item_name]}%'")
---
SELECT "temp_reqs".* FROM "temp_reqs" WHERE (team_id = 1)
SELECT "requests".* FROM "requests" WHERE (team_id = 2)
SELECT "items".* FROM "items" WHERE (item_name LIKE 'p%')