app/controllers/users_controller.rb

  def login
    if params[:username].present? && params[:password].present?
      found_user = User.where(:user_name => params[:username]).first
      found_team = Team.where(:id => found_user.team_id).first
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = 'admin1' ORDER BY "users"."id" ASC LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 0 ORDER BY "teams"."id" ASC LIMIT 1